app/views/gossips/show.html.erb


	<% @my_gossip.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 17]]