app/controllers/comments_controller.rb

  def create
    p params[:id]
    @my_new_comment = Comment.create(anonymous_commentator: params[:author], body: params[:comment])
    Gossip.find(params[:id].to_i).comments << @my_new_comment
    if @my_new_comment.save
---
INSERT INTO "comments" ("gossip_id", "anonymous_commentator", "body") VALUES (?, ?, ?)  [["gossip_id", 6], ["anonymous_commentator", "III"], ["body", "III"]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "comments" SET "body" = ?, "anonymous_commentator" = ? WHERE "comments"."id" = ?  [["body", "AAA"], ["anonymous_commentator", "BBB"], ["id", 46]]

  def show
    @my_comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def edit
    @my_comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]

  def update
    @my_comment = Comment.find(params[:id])
    @my_comment.body = params['comment']['body']
    @my_comment.anonymous_commentator = params['comment']['anonymous_commentator']
    @my_comment.save
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "comments" SET "body" = ?, "anonymous_commentator" = ? WHERE "comments"."id" = ?  [["body", "EEE"], ["anonymous_commentator", "EEE"], ["id", 10]]

  def destroy
  	my_id = Comment.find(params[:id]).gossip.id
    Comment.find(params[:id]).delete
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 10]]