app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 6]]
---
  def index
    @gossip_array = Gossip.all.map do |gossip|
      author_content_id = [ gossip.anonymous_author, gossip.content, gossip.id, gossip.comments.count ]

INSERT INTO "gossips" ("anonymous_author", "content") VALUES (?, ?)  [["anonymous_author", "dzafzf"], ["content", "zafazfazf"]]
INSERT INTO "gossips" ("anonymous_author", "content") VALUES (?, ?)  [["anonymous_author", "BLABAL"], ["content", "lalalalalala"]]
---
  def create
    @my_new_gossip = Gossip.create(anonymous_author: params[:author], content: params[:content])
    if @my_new_gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @my_gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
---
  def edit
    @my_gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = ?, "anonymous_author" = ? WHERE "gossips"."id" = ?  [["content", "regreagegrg"], ["anonymous_author", "gaeggreag"], ["id", 23]]
UPDATE "gossips" SET "content" = ?, "anonymous_author" = ? WHERE "gossips"."id" = ?  [["content", "aaaaa"], ["anonymous_author", "bbbb"], ["id", 3]]
---
  def update
    @my_gossip = Gossip.find(params[:id])
    @my_gossip.content = params['gossip']['content']
    @my_gossip.anonymous_author = params['gossip']['anonymous_author']
    @my_gossip.save
    if @my_gossip.save

DELETE FROM "gossips" WHERE "gossips"."id" = ?  [["id", 27]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
---
  def destroy
    Gossip.find(params[:id]).delete